
===========================================================================
report_tns
============================================================================
tns -33.02

===========================================================================
report_wns
============================================================================
wns -2.23

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.23

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.54
