
===========================================================================
report_tns
============================================================================
tns -5.84

===========================================================================
report_wns
============================================================================
wns -1.40

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.40

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.31
