###############################################################################
# Created by write_sdc
# Sun Jun  1 18:19:16 2025
###############################################################################
current_design Lab4
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {CLK}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A1[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A1[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A1[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A1[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A1[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A2[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A2[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A2[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A2[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A2[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A3[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A3[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A3[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A3[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A3[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[10]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[11]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[12]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[13]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[14]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[15]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[16]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[17]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[18]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[19]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[20]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[21]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[22]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[23]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[24]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[25]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[26]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[27]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[28]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[29]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[30]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[31]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[5]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[6]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[7]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[8]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[9]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[10]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[11]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[12]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[13]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[14]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[15]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[16]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[17]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[18]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[19]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[20]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[21]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[22]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[23]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[24]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[25]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[26]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[27]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[28]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[29]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[30]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[31]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[5]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[6]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[7]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[8]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[9]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[10]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[11]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[12]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[13]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[14]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[15]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[16]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[17]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[18]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[19]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[1]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[20]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[21]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[22]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[23]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[24]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[25]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[26]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[27]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[28]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[29]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[2]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[30]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[31]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[3]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[4]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[5]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[6]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[7]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[8]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WD3[9]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {WE3}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {opcode[0]}]
set_input_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {opcode[1]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[0]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[10]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[11]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[12]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[13]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[14]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[15]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[16]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[17]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[18]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[19]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[1]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[20]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[21]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[22]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[23]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[24]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[25]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[26]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[27]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[28]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[29]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[2]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[30]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[31]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[3]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[4]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[5]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[6]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[7]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[8]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD1[9]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[0]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[10]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[11]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[12]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[13]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[14]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[15]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[16]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[17]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[18]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[19]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[1]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[20]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[21]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[22]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[23]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[24]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[25]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[26]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[27]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[28]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[29]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[2]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[30]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[31]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[3]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[4]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[5]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[6]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[7]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[8]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {RD2[9]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[0]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[10]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[11]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[12]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[13]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[14]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[15]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[16]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[17]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[18]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[19]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[1]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[20]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[21]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[22]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[23]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[24]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[25]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[26]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[27]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[28]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[29]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[2]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[30]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[31]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[3]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[4]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[5]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[6]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[7]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[8]}]
set_output_delay 2.5000 -clock [get_clocks {core_clock}] -add_delay [get_ports {result[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
