
===========================================================================
report_tns
============================================================================
tns -2.74

===========================================================================
report_wns
============================================================================
wns -0.88

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.88

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.27
